{"M1036": {"name": "Account Use Policies", "link": "https://attack.mitre.org/mitigations/M1036", "desc": "Configure features related to account use like login attempt lockouts, specific login times, etc."}, "M1015": {"name": "Active Directory Configuration", "link": "https://attack.mitre.org/mitigations/M1015", "desc": "Configure Active Directory to prevent use of certain techniques; use SID Filtering, etc."}, "M1049": {"name": "Antivirus/Antimalware", "link": "https://attack.mitre.org/mitigations/M1049", "desc": "Use signatures or heuristics to detect malicious software."}, "M1013": {"name": "Application Developer Guidance", "link": "https://attack.mitre.org/mitigations/M1013", "desc": "This mitigation describes any guidance or training given to developers of applications to avoid introducing security weaknesses that an adversary may be able to take advantage of."}, "M1048": {"name": "Application Isolation and Sandboxing", "link": "https://attack.mitre.org/mitigations/M1048", "desc": "Restrict execution of code to a virtual environment on or in transit to an endpoint system."}, "M1047": {"name": "Audit", "link": "https://attack.mitre.org/mitigations/M1047", "desc": "Perform audits or scans of systems, permissions, insecure software, insecure configurations, etc. to identify potential weaknesses."}, "M1040": {"name": "Behavior Prevention on Endpoint", "link": "https://attack.mitre.org/mitigations/M1040", "desc": "Use capabilities to prevent suspicious behavior patterns from occurring on endpoint systems. This could include suspicious process, file, API call, etc. behavior."}, "M1046": {"name": "Boot Integrity", "link": "https://attack.mitre.org/mitigations/M1046", "desc": "Use secure methods to boot a system and verify the integrity of the operating system and loading mechanisms."}, "M1045": {"name": "Code Signing", "link": "https://attack.mitre.org/mitigations/M1045", "desc": "Enforce binary and application integrity with digital signature verification to prevent untrusted code from executing."}, "M1043": {"name": "Credential Access Protection", "link": "https://attack.mitre.org/mitigations/M1043", "desc": "Use capabilities to prevent successful credential access by adversaries; including blocking forms of credential dumping."}, "M1053": {"name": "Data Backup", "link": "https://attack.mitre.org/mitigations/M1053", "desc": "Take and store data backups from end user systems and critical servers. Ensure backup and storage systems are hardened and kept separate from the corporate network to prevent compromise."}, "M1057": {"name": "Data Loss Prevention", "link": "https://attack.mitre.org/mitigations/M1057", "desc": "Use a data loss prevention (DLP) strategy to categorize sensitive data, identify data formats indicative of personal identifiable information (PII), and restrict exfiltration of sensitive data.[1]"}, "M1042": {"name": "Disable or Remove Feature or Program", "link": "https://attack.mitre.org/mitigations/M1042", "desc": "Remove or deny access to unnecessary and potentially vulnerable software to prevent abuse by adversaries."}, "M1055": {"name": "Do Not Mitigate", "link": "https://attack.mitre.org/mitigations/M1055", "desc": "This category is to associate techniques that mitigation might increase risk of compromise and therefore mitigation is not recommended."}, "M1041": {"name": "Encrypt Sensitive Information", "link": "https://attack.mitre.org/mitigations/M1041", "desc": "Protect sensitive information with strong encryption."}, "M1039": {"name": "Environment Variable Permissions", "link": "https://attack.mitre.org/mitigations/M1039", "desc": "Prevent modification of environment variables by unauthorized users and groups."}, "M1038": {"name": "Execution Prevention", "link": "https://attack.mitre.org/mitigations/M1038", "desc": "Block execution of code on a system through application control, and/or script blocking."}, "M1050": {"name": "Exploit Protection", "link": "https://attack.mitre.org/mitigations/M1050", "desc": "Use capabilities to detect and block conditions that may lead to or be indicative of a software exploit occurring."}, "M1037": {"name": "Filter Network Traffic", "link": "https://attack.mitre.org/mitigations/M1037", "desc": "Use network appliances to filter ingress or egress traffic and perform protocol-based filtering. Configure software on endpoints to filter network traffic."}, "M1035": {"name": "Limit Access to Resource Over Network", "link": "https://attack.mitre.org/mitigations/M1035", "desc": "Prevent access to file shares, remote access to systems, unnecessary services. Mechanisms to limit access may include use of network concentrators, RDP gateways, etc."}, "M1034": {"name": "Limit Hardware Installation", "link": "https://attack.mitre.org/mitigations/M1034", "desc": "Block users or groups from installing or using unapproved hardware on systems, including USB devices."}, "M1033": {"name": "Limit Software Installation", "link": "https://attack.mitre.org/mitigations/M1033", "desc": "Block users or groups from installing unapproved software."}, "M1032": {"name": "Multi-factor Authentication", "link": "https://attack.mitre.org/mitigations/M1032", "desc": "Use two or more pieces of evidence to authenticate to a system; such as username and password in addition to a token from a physical smart card or token generator."}, "M1031": {"name": "Network Intrusion Prevention", "link": "https://attack.mitre.org/mitigations/M1031", "desc": "Use intrusion detection signatures to block traffic at network boundaries."}, "M1030": {"name": "Network Segmentation", "link": "https://attack.mitre.org/mitigations/M1030", "desc": "Architect sections of the network to isolate critical systems, functions, or resources. Use physical and logical segmentation to prevent access to potentially sensitive systems and information. Use a DMZ to contain any internet-facing services that should not be exposed from the internal network. Configure separate virtual private cloud (VPC) instances to isolate critical cloud systems."}, "M1028": {"name": "Operating System Configuration", "link": "https://attack.mitre.org/mitigations/M1028", "desc": "Make configuration changes related to the operating system or a common feature of the operating system that result in system hardening against techniques."}, "M1027": {"name": "Password Policies", "link": "https://attack.mitre.org/mitigations/M1027", "desc": "Set and enforce secure password policies for accounts."}, "M1056": {"name": "Pre-compromise", "link": "https://attack.mitre.org/mitigations/M1056", "desc": "This category is used for any applicable mitigation activities that apply to techniques occurring before an adversary gains Initial Access, such as Reconnaissance and Resource Development techniques."}, "M1026": {"name": "Privileged Account Management", "link": "https://attack.mitre.org/mitigations/M1026", "desc": "Manage the creation, modification, use, and permissions associated to privileged accounts, including SYSTEM and root."}, "M1025": {"name": "Privileged Process Integrity", "link": "https://attack.mitre.org/mitigations/M1025", "desc": "Protect processes with high privileges that can be used to interact with critical system components through use of protected process light, anti-process injection defenses, or other process integrity enforcement measures."}, "M1029": {"name": "Remote Data Storage", "link": "https://attack.mitre.org/mitigations/M1029", "desc": "Use remote security log and sensitive file storage where access can be controlled better to prevent exposure of intrusion detection log data or sensitive information."}, "M1022": {"name": "Restrict File and Directory Permissions", "link": "https://attack.mitre.org/mitigations/M1022", "desc": "Restrict access by setting directory and file permissions that are not specific to users or privileged accounts."}, "M1044": {"name": "Restrict Library Loading", "link": "https://attack.mitre.org/mitigations/M1044", "desc": "Prevent abuse of library loading mechanisms in the operating system and software to load untrusted code by configuring appropriate library loading mechanisms and investigating potential vulnerable software."}, "M1024": {"name": "Restrict Registry Permissions", "link": "https://attack.mitre.org/mitigations/M1024", "desc": "Restrict the ability to modify certain hives or keys in the Windows Registry."}, "M1021": {"name": "Restrict Web-Based Content", "link": "https://attack.mitre.org/mitigations/M1021", "desc": "Restrict use of certain websites, block downloads/attachments, block Javascript, restrict browser extensions, etc."}, "M1054": {"name": "Software Configuration", "link": "https://attack.mitre.org/mitigations/M1054", "desc": "Implement configuration changes to software (other than the operating system) to mitigate security risks associated to how the software operates."}, "M1020": {"name": "SSL/TLS Inspection", "link": "https://attack.mitre.org/mitigations/M1020", "desc": "Break and inspect SSL/TLS sessions to look at encrypted web traffic for adversary activity."}, "M1019": {"name": "Threat Intelligence Program", "link": "https://attack.mitre.org/mitigations/M1019", "desc": "A threat intelligence program helps an organization generate their own threat intelligence information and track trends to inform defensive priorities to mitigate risk."}, "M1051": {"name": "Update Software", "link": "https://attack.mitre.org/mitigations/M1051", "desc": "Perform regular software updates to mitigate exploitation risk."}, "M1052": {"name": "User Account Control", "link": "https://attack.mitre.org/mitigations/M1052", "desc": "Configure Windows User Account Control to mitigate risk of adversaries obtaining elevated process access."}, "M1018": {"name": "User Account Management", "link": "https://attack.mitre.org/mitigations/M1018", "desc": "Manage the creation, modification, use, and permissions associated to user accounts."}, "M1017": {"name": "User Training", "link": "https://attack.mitre.org/mitigations/M1017", "desc": "Train users to be aware of access or manipulation attempts by an adversary to reduce the risk of successful spearphishing, social engineering, and other techniques that involve user interaction."}, "M1016": {"name": "Vulnerability Scanning", "link": "https://attack.mitre.org/mitigations/M1016", "desc": "Vulnerability scanning is used to find potentially exploitable software vulnerabilities to remediate them."}}